jimmywong2003/nrf52-ble-range-estimator/ble_peripheral_long_range_demo_kit/main.c
/**
 * Copyright (c) 2014 - 2019, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
/** @file
 *
 * @defgroup ble_sdk_uart_over_ble_main main.c
 * @{
 * @ingroup  ble_sdk_app_nus_eval
 * @brief    UART over BLE application main file.
 *
 * This file contains the source code for a sample application that uses the Nordic UART service.
 * This application uses the @ref srvlib_conn_params module.
 */


#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "app_timer.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "bsp_btn_ble.h"
#include "nrf_pwr_mgmt.h"

#include "app_scheduler.h"
#include "nrf_delay.h"

#if defined (UART_PRESENT)
#include "nrf_uart.h"
#endif
#if defined (UARTE_PRESENT)
#include "nrf_uarte.h"
#endif

#include "ble_image_transfer_service.h"
#include "ble_file_transfer_service.h"

#include "app_display.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#define PHY_SELECTION_BUTTON              BSP_BUTTON_0
#define TX_POWER_BUTTON                   BSP_BUTTON_1
#define APP_STATE_BUTTON                  BSP_BUTTON_2
#define THROUGHPUT_TEST_BUTTON            BSP_BUTTON_3

#define PHY_SELECTION_LED                BSP_BOARD_LED_0
#define TX_POWER_LED                     BSP_BOARD_LED_1
#define ADVERTISING_LED                  BSP_BOARD_LED_2
#define CONNECTED_LED                    BSP_BOARD_LED_3

//
// #define PHY_SELECTION_LED               BSP_BOARD_LED_0                                 /**< LED indicating which phy is in use. */
// #define OUTPUT_POWER_SELECTION_LED      BSP_BOARD_LED_1                                 /**< LED indicating at which ouput power the radio is transmitting */
// #define NON_CONN_ADV_LED                BSP_BOARD_LED_2                                 /**< LED indicting if the device is advertising non-connectable advertising or not. */
// #define CONN_ADV_CONN_STATE_LED         BSP_BOARD_LED_3                                 /**< LED indicating that if device is advertising with connectable advertising, in a connected state, or none. */
//
// #define PHY_SELECTION_BUTTON                  BSP_BUTTON_0
// #define PHY_SELECTION_BUTTON_EVENT            BSP_EVENT_KEY_0
// #define OUTPUT_POWER_SELECTION_BUTTON         BSP_BUTTON_1
// #define OUTPUT_POWER_SELECTION_BUTTON_EVENT   BSP_EVENT_KEY_1
// #define NON_CONN_OR_CONN_ADV_BUTTON           BSP_BUTTON_2
// #define NON_CONN_OR_CONN_ADV_BUTTON_EVENT     BSP_EVENT_KEY_2
// #define BUTTON_NOT_IN_USE                     BSP_BUTTON_3
// #define BUTTON_NOT_IN_USE_EVENT               BSP_EVENT_KEY_3
//
// #define FAST_BLINK_INTERVAL   APP_TIMER_TICKS(200)
// APP_TIMER_DEF(m_non_conn_fast_blink_timer_id);                /**< Timer used to toggle LED indicating non-connectable advertising on the dev. kit. */
// APP_TIMER_DEF(m_conn_adv_fast_blink_timer_id);                /**< Timer used to toggle LED indicating connectable advertising on the dev. kit. */
//
// #define SLOW_BLINK_INTERVAL   APP_TIMER_TICKS(750)
// APP_TIMER_DEF(m_1Mbps_led_slow_blink_timer_id);                /**< Timer used to toggle LED for phy selection indication on the dev.kit. */
// APP_TIMER_DEF(m_8dBm_led_slow_blink_timer_id);                 /**< Timer used to toggle LED for output power selection indication on the dev.kit. */
//
// // Type holding the two output power options for this application.
// typedef enum
// {
//         SELECTION_0_dBm = 0,
//         SELECTION_8_dBm = 8
// } output_power_seclection_t;
//
// // Type holding the two advertising selection modes.
// typedef enum
// {
//         SELECTION_CONNECTABLE = 0,
//         SELECTION_NON_CONNECTABLE
// } adv_scan_type_seclection_t;
//
// // Type holding the two possible phy options.
// typedef enum
// {
//         SELECTION_1M_PHY = 0,
//         SELECTION_2M_PHY,
//         SELECTION_CODED_PHY
// } adv_scan_phy_seclection_t;
//
// static adv_scan_type_seclection_t m_adv_scan_type_selected = SELECTION_CONNECTABLE;     /**< Global variable holding the current scan selection mode. */
// static adv_scan_phy_seclection_t m_adv_scan_phy_selected  = SELECTION_CODED_PHY;         /**< Global variable holding the current phy selection. */
// static output_power_seclection_t m_output_power_selected  = SELECTION_8_dBm;             /**< Global variable holding the current output power selection. */
// static bool m_app_initiated_disconnect  = false;                   //The application has initiated disconnect. Used to "tell" on_ble_gap_evt_disconnected() to not start advertising.
// static bool m_waiting_for_disconnect_evt     = false;             // Disconnect is initiated. The application has to wait for BLE_GAP_EVT_DISCONNECTED before proceeding.
//

#define DEVICE_TX_DATA_SEND_BUTTON                BSP_BUTTON_2
#define DEVICE_TX_CMD_SEND_BUTTON                 BSP_BUTTON_3

#define APP_BLE_CONN_CFG_TAG            1                                           /**< A tag identifying the SoftDevice BLE configuration. */

#define DEVICE_NAME                     "DeviceUART"                               /**< Name of device. Will be included in the advertising data. */
#define NUS_SERVICE_UUID_TYPE           BLE_UUID_TYPE_VENDOR_BEGIN                  /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_BLE_OBSERVER_PRIO           3                                           /**< Application's BLE observer priority. You shouldn't need to modify this value. */

#define APP_ADV_INTERVAL                64                                          /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */

#define APP_ADV_DURATION                0//                                         /**< The advertising duration (180 seconds) in units of 10 milliseconds. */

