jimmywong2003/nrf52-ble-range-estimator/ble_peripheral_long_range_demo_kit/main.c
static void display_update()
{
        static bool first_update = true;
        if(first_update)
        {
                m_application_state.main_title = "Peripheral LRange";
                app_display_create_main_screen(&m_application_state);
                first_update = false;
        }
        else
        {
                app_display_update_main_screen(&m_application_state);
        }
        app_display_update();
}

/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
        ret_code_t err_code;
        ble_gap_phys_t phys;

        switch (pin_no)
        {
        case PHY_SELECTION_BUTTON:
                if(button_action == APP_BUTTON_PUSH && m_application_state.app_state == APP_STATE_IDLE)
                {
                        m_application_state.phy = (m_application_state.phy + 1) % APP_PHY_LIST_END;
                        advertising_init();
                        display_update();
                }
                break;

        case TX_POWER_BUTTON:
                if(button_action == APP_BUTTON_PUSH)
                {
                        m_application_state.tx_power = (m_application_state.tx_power + 1) % 3;
                        int8_t tx_power = (int8_t)(m_application_state.tx_power * 4);
                        if(m_application_state.app_state == APP_STATE_CONNECTED)
                        {
                                err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_CONN, m_conn_handle, tx_power);
                                APP_ERROR_CHECK(err_code);
                                NRF_LOG_INFO("TX Power for Connection: %d", tx_power);
                        }
                        else
                        {
                                err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, m_adv_handle, tx_power);
                                APP_ERROR_CHECK(err_code);
                                NRF_LOG_INFO("TX Power for Advertising: %d", tx_power);
                        }
                        display_update();
                }
                break;

        case APP_STATE_BUTTON:
                if(button_action == APP_BUTTON_PUSH)
                {
                        NRF_LOG_INFO("Press the APP_STATE_BUTTON %d", m_application_state.app_state);
                        if(m_application_state.app_state == APP_STATE_IDLE)
                        {
                                advertising_start();
                        }
                        else
                        {
                                ble_go_to_idle();
                        }
                }
                break;

        case THROUGHPUT_TEST_BUTTON:
                NRF_LOG_INFO("Send button state change.");
                // err_code = ble_lbs_on_button_change(m_conn_handle[0], &m_lbs, button_action);
                // if (err_code != NRF_SUCCESS &&
                //     err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                //     err_code != NRF_ERROR_INVALID_STATE &&
                //     err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
                // {
                //         APP_ERROR_CHECK(err_code);
                // }
                m_application_state.button_pressed = button_action;
                display_update();
                break;

        default:
                APP_ERROR_HANDLER(pin_no);
                break;
        }
}

/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
        ret_code_t err_code;

        //The array must be static because a pointer to it will be saved in the button handler module.
        static app_button_cfg_t buttons[] =
        {
                {PHY_SELECTION_BUTTON,       false, BUTTON_PULL, button_event_handler},
                {TX_POWER_BUTTON,  false, BUTTON_PULL, button_event_handler},
                {APP_STATE_BUTTON, false, BUTTON_PULL, button_event_handler},
                {THROUGHPUT_TEST_BUTTON, false, BUTTON_PULL, button_event_handler}
        };

        err_code = app_button_init(buttons, sizeof(buttons) / sizeof(buttons[0]),
                                   BUTTON_DETECTION_DELAY);
        APP_ERROR_CHECK(err_code);

        err_code = app_button_enable();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
        ret_code_t err_code = NRF_LOG_INIT(NULL);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
        ret_code_t err_code;
        err_code = nrf_pwr_mgmt_init();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
        app_sched_execute();
        if (NRF_LOG_PROCESS() == false)
        {
                nrf_pwr_mgmt_run();
        }
}


// /**@brief Function for starting advertising.
//  */
// static void advertising_start(void)
// {
//         uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
//         APP_ERROR_CHECK(err_code);
// }

/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
        ret_code_t err_code;

        if (m_application_state.app_state == APP_STATE_IDLE)
        {
                err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
                if(err_code == NRF_SUCCESS)
                {
                        bsp_board_led_on(ADVERTISING_LED);

                        m_application_state.app_state = APP_STATE_ADVERTISING;
                        display_update();
                }
                else
                {
                        APP_ERROR_CHECK(err_code);
                }

//                m_advertising_is_running = true;
        }
}

/**@brief Application main function.
 */
int main(void)
{
        bool erase_bonds;

        // Initialize.
        uart_init();
        log_init();
        timers_init();

        buttons_init();
        power_management_init();
        ble_stack_init();
        scheduler_init();
        gap_params_init();
        gatt_init();
        services_init();
        advertising_init();
        conn_params_init();

        // Start execution.
        NRF_LOG_INFO("\n\n\n\n");
        NRF_LOG_INFO("New Firmware Start %s", (uint8_t *)DEVICE_NAME);
//        advertising_start();

        app_display_init(&m_application_state);
        display_update();

        // Enter main loop.
        for (;;)
        {
                idle_state_handle();
        }
}


/**
 * @}
 */
